Masmiseim36/nxpSDK/devices/MK12D5/mcuxpresso/startup_mk12d5.cpp
    // Chip Level - MK12D5
    DMA0_IRQHandler,            // 16: DMA channel 0 transfer complete
    DMA1_IRQHandler,            // 17: DMA channel 1 transfer complete
    DMA2_IRQHandler,            // 18: DMA channel 2 transfer complete
    DMA3_IRQHandler,            // 19: DMA channel 3 transfer complete
    DMA4_IRQHandler,            // 20: DMA channel 4 transfer complete
    DMA5_IRQHandler,            // 21: DMA channel 5 transfer complete
    DMA6_IRQHandler,            // 22: DMA channel 6 transfer complete
    DMA7_IRQHandler,            // 23: DMA channel 7 transfer complete
    DMA8_IRQHandler,            // 24: DMA channel 8 transfer complete
    DMA9_IRQHandler,            // 25: DMA channel 9 transfer complete
    DMA10_IRQHandler,           // 26: DMA channel 10 transfer complete
    DMA11_IRQHandler,           // 27: DMA channel 11 transfer complete
    DMA12_IRQHandler,           // 28: DMA channel 12 transfer complete
    DMA13_IRQHandler,           // 29: DMA channel 13 transfer complete
    DMA14_IRQHandler,           // 30: DMA channel 14 transfer complete
    DMA15_IRQHandler,           // 31: DMA channel 15 transfer complete
    DMA_Error_IRQHandler,       // 32: DMA channel 0 - 15 error
    MCM_IRQHandler,             // 33: MCM normal interrupt
    FTFL_IRQHandler,            // 34: FTFL command complete
    Read_Collision_IRQHandler,  // 35: FTFL read collision
    LVD_LVW_IRQHandler,         // 36: PMC controller low-voltage detect, low-voltage warning
    LLWU_IRQHandler,            // 37: Low leakage wakeup unit
    WDOG_EWM_IRQHandler,        // 38: Single interrupt vector for  WDOG and EWM
    Reserved39_IRQHandler,      // 39: Reserved interrupt
    I2C0_IRQHandler,            // 40: Inter-integrated circuit 0
    I2C1_IRQHandler,            // 41: Inter-integrated circuit 1
    SPI0_IRQHandler,            // 42: Serial peripheral Interface 0
    SPI1_IRQHandler,            // 43: Serial peripheral Interface 1
    I2S0_Tx_IRQHandler,         // 44: Integrated interchip sound 0 transmit interrupt
    I2S0_Rx_IRQHandler,         // 45: Integrated interchip sound 0 receive interrupt
    Reserved46_IRQHandler,      // 46: Reserved interrupt
    UART0_RX_TX_IRQHandler,     // 47: UART0 receive/transmit interrupt
    UART0_ERR_IRQHandler,       // 48: UART0 error interrupt
    UART1_RX_TX_IRQHandler,     // 49: UART1 receive/transmit interrupt
    UART1_ERR_IRQHandler,       // 50: UART1 error interrupt
    UART2_RX_TX_IRQHandler,     // 51: UART2 receive/transmit interrupt
    UART2_ERR_IRQHandler,       // 52: UART2 error interrupt
    UART3_RX_TX_IRQHandler,     // 53: UART3 receive/transmit interrupt
    UART3_ERR_IRQHandler,       // 54: UART3 error interrupt
    ADC0_IRQHandler,            // 55: Analog-to-digital converter 0
    CMP0_IRQHandler,            // 56: Comparator 0
    CMP1_IRQHandler,            // 57: Comparator 1
    FTM0_IRQHandler,            // 58: FlexTimer module 0 fault, overflow and channels interrupt
    FTM1_IRQHandler,            // 59: FlexTimer module 1 fault, overflow and channels interrupt
    FTM2_IRQHandler,            // 60: FlexTimer module 2 fault, overflow and channels interrupt
    CMT_IRQHandler,             // 61: Carrier modulator transmitter
    RTC_IRQHandler,             // 62: Real time clock
    RTC_Seconds_IRQHandler,     // 63: Real time clock seconds
    PIT0_IRQHandler,            // 64: Periodic interrupt timer channel 0
    PIT1_IRQHandler,            // 65: Periodic interrupt timer channel 1
    PIT2_IRQHandler,            // 66: Periodic interrupt timer channel 2
    PIT3_IRQHandler,            // 67: Periodic interrupt timer channel 3
    PDB0_IRQHandler,            // 68: Programmable delay block
    Reserved69_IRQHandler,      // 69: Reserved interrupt
    Reserved70_IRQHandler,      // 70: Reserved interrupt
    Reserved71_IRQHandler,      // 71: Reserved interrupt
    DAC0_IRQHandler,            // 72: Digital-to-analog converter 0
    MCG_IRQHandler,             // 73: Multipurpose clock generator
    LPTMR0_IRQHandler,          // 74: Low power timer interrupt
    PORTA_IRQHandler,           // 75: Port A pin detect interrupt
    PORTB_IRQHandler,           // 76: Port B pin detect interrupt
    PORTC_IRQHandler,           // 77: Port C pin detect interrupt
    PORTD_IRQHandler,           // 78: Port D pin detect interrupt
    PORTE_IRQHandler,           // 79: Port E pin detect interrupt
    SWI_IRQHandler,             // 80: Software interrupt
}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int *pulSrc = (unsigned int*) romstart;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((section(".after_vectors.reset")))
void ResetISR(void) {

    // Disable interrupts
    __asm volatile ("cpsid i");

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();
#else
    // Disable Watchdog
    //  Write 0xC520 to watchdog unlock register
    *((volatile unsigned short *)0x4005200E) = 0xC520;
    //  Followed by 0xD928 to complete the unlock
    *((volatile unsigned short *)0x4005200E) = 0xD928;
    // Now disable watchdog via STCTRLH register
    *((volatile unsigned short *)0x40052000) = 0x01D2u;
#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
	unsigned int LoadAddr, ExeAddr, SectionLen;
	unsigned int *SectionTableAddr;

